tutorials/heatTransfer/buoyantBoussinesqSimpleSolver/laminar/ACCM_sphericalCavity/0/p_rgh
/*---------------------------------------------------------------------------*\
Caelus 9.04
 Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    symm
    {
        type            symmetryPlane;
    }
    wall-1
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        rho             rhok;
        value           uniform 0;
    }
    wall-2
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        rho             rhok;
        value           uniform 0;
    }
}


// ************************************************************************* //
