tutorials/heatTransfer/buoyantBoussinesqSimpleSolver/laminar/ACCM_sphericalCavity/0/T
/*---------------------------------------------------------------------------*\
Caelus 9.04
 Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
18564
(
-0.0820748942239
-0.0820748942264
-0.0820748942239
-0.0694479874202
-0.0937934984108
-0.0871595408052
-0.0871082007546
-0.0820748942289
...
)
;

boundaryField
{
    symm
    {
        type            symmetryPlane;
    }
    wall-1
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
350
(
-0.333702106867
-0.350405617591
-0.368299782555
-0.387103239919
-0.404954200517
-0.419178955604
-0.427077080282
-0.427103190088
...
)
;
    }
    wall-2
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
350
(
0.333713920804
0.35043694235
0.368346040134
0.387153637806
0.405005887575
0.419224732124
0.427103298886
0.427076872653
...
)
;
    }
}


// ************************************************************************* //
